[
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "DataViz Makeover 1",
    "description": "Explore different perspectives and approaches to design more truthful and enlightening data visualisation.",
    "author": [
      {
        "name": "Shen Xiaojing",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below. \r\n1.1 Clarity\r\nIt is hard to compare countries’ performance across six separate charts shared with different scales in y-axis.\r\nFor x-axis with title month of period, but we cannot tell each month performance clearly in the charts.\r\nFor Japan, there is only a year ‘2020’ at the x-axis, which is not align with other charts.\r\nThe title is misleading with ‘top trading’, we do not know the rank of top trading is by export or import or the total amount.\r\n(5)The title as ‘six countries’ but some of them are only regions instead of countries.\r\nIn raw data, the trade amount is with unit as ‘thousand dollars’, the chart/title did not mention.\r\n1.2 Aesthetic\r\nThe tick line for y-axis is not obvious.\r\nFor each chart, there are two y-axes for export and import with different scale, it’ s not possible to put them together to do comparison.\r\nTo show the time-serious trend line instead of the area chart which is hard to see the trade amount changing along the time.\r\nThere is clear indication of data source stated in the chart.\r\nThere is no clear indication of month in the y-axis.\r\nEach chart is too narrow to show the message of monthly data.\r\nThe colors of export and import are not distinguished.\r\n2.0 Alternative design\r\n\r\nIn order to clearly compare difference between 2019 and 2020 and in export and import value and trend chart, 2 individual charts as show in the initial visualization.\r\nAll charts with title and subtitle to explain key words and definitions will be showing in graph.\r\nY-axis are unified to do comparison in the same scale for different years and different trading methods.\r\n3.0 Proposed Visualization\r\nData Visualization can be found in Tableau Public Server: Dashboard\r\n4.0 Step-by-step Guide\r\n4.1 Data preparation\r\nSelect only data for 6 regions, Filter variables = ‘Hongkong, Mainland China, Japan, Malaysia, Taiwan, US’. Select only year 2019-2020 for import and export data sets and paste into a new sheet using Microsoft Excel. \r\n4.2 Import the two data sets into Tableau.\r\nConnection: Choose Extract to allow them to go public\r\n\r\n4.3 The first chart is showing the difference between 2019 and 2020.\r\nTo make a pyramid chart for import and export.Left chart as import and right chart as export.\r\nChange the data type for [Year] from number to date&time \r\nColumns: Put [Export] and [Import] value\r\nRows: Region \r\nColor: Year Edit color as opacity 66% \r\nEdit x- axis, to make two axis (export and import) face to each other, by reversing the scale of export.\r\n\r\nTo make year 2019 and 2020 stack to each other to compare easily, need to off the stack marks. \r\nFinal look \r\n4.4 The second chart is showing the trend between 2019 and 2020.\r\n\r\nColumns: Region, Month Rows: Sum by month Color: Export or Import\r\n\r\nDate change to Month\r\n\r\n4.5 Create new dashboard\r\n\r\n5.0 Major Observations\r\nMainland China is one of the major trade partners with Singapore which has largest value among the 6 regions for both export and import in year 2019 and year 2020.\r\nFor Malaysia, there is a sharp decline in both import and export in April 2020.From news, Statistician chief Datuk Seri Dr Mohd Uzir Mahidin said the decrease was due to the shutdown of most of the national economic sectors since the enforcement of the Movement Control Order (MCO) on March 18 due to the Covid-19 pandemic. [Sharp decline in Malaysia’s exports | New Straits Times, 2021] (https://www.nst.com.my/business/2020/06/597855/sharp-decline-malaysias-exports)\\\r\nThere is a sharp decrease in May 2020 for US import value. The declines due to the impact of COVID-19, as many businesses were operating at limited capacity or ceased operations completely, and the movement of travelers across borders was restricted. U.S. International Trade in Goods and Services, May 2020\r\nTaiwan and Hong Kong both import and export are increasing from 2019 to 2020, with a continuous increasing trend.\r\nHong Kong has the second highest in export value but the last for the import value. The Import value is only about 1/10 of Mainland China.\r\nJapan Import and export value are almost equivalent in 2019 and 2020, which is relatively stable.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T20:30:17+08:00",
    "input_file": "my-1st-post.knit.md"
  },
  {
    "path": "posts/2021-06-16-my-2nd-post/",
    "title": "DataViz Makeover 2",
    "description": "Explore different perspectives and approaches to design more truthful and enlightening data visualisation.",
    "author": [
      {
        "name": "Shen Xiaojing",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualisation\r\nThe original visualization can be seen below.  The data was retrieved from the Department of Statistics, Singapore (DOS)\r\n1.1 Clarity\r\nThere is no title for this graph: not indicating which year and time for this graph, we do not have idea on the purpose of this graph.\r\nThere is no unit in both x, y -axis :should be in billion Dollars instead of million ,since the data source indicates “(Thousand Dollars)”.\r\nThere is no year to year difference : The information given as “Singapore exports with china since 2009 exceeds with USA since 2006” , but it is not reflecting in the chart, we can not tell year to year difference by this chart.\r\nThere is no legend:for the scale of color and size for the bubbles.\r\n1.2 Aesthetic\r\nOverlap problem: There is no transparency of circle, some bubble was blocked by others. Some center points are hidden by other circle/title.\r\nToo colorful in the chart: however, the color separation between net importers and net exporters are not distinct.The color for bubbles also do not have any useful information.\r\nTitle of each bubble is misleading: the direction is not consistent and the size of each diaLog box is not aligned .\r\n2.0 Alternative design\r\n\r\nIn order to clearly compare difference between 2010 to 2020 for each country in net trade value and total trade value and trend chart, 2 individual charts as show in the initial visualization.\r\nAll charts with title and captions to explain key words and definitions will be showing in graph.\r\nThe value units as been unified by billion Singapore dollars.\r\nFor the bubble chart, the Color difference is by net trade value and size difference is by total trade value.\r\nFor every bubble, there is a tooltip to indicate net trade value and total trade value and the ranking respectively. In addition, there is a chart shows 10 years changing in the tooltip.\r\n3.0 Proposed Visualization\r\nData Visualization can be found in Tableau Public Server: Dashboard\r\nBubble chart\r\n4.0 Step-by-step Guide\r\n4.1 Data preparation\r\nThere are 2 .xlsx format sheets:\r\nT1 : Merchandise Imports by Region/Market, Monthly\r\nT2 : Merchandise Exports by Region/Market, Monthly\r\nWith variables(country),Date,Export and import value\r\n\r\n4.2 Import the two data sets into Tableau.\r\n(1)launch the Tableau Desktop software.\r\n(2)Import the Data. From the local directory where the dataviz2_rawData.csv is saved, drag and drop into the homepage as shown:\r\n(3)Drag T1 into the workspace.\r\n\r\n(4)Apply filter for country, keep 10 countries.\r\nClick on the Add|Filter button and then Add.\r\n\r\nSelect all the 10 Regions that were listed: Mainland China, Malaysia, Hong Kong, Taiwan, United States, Japan, Korea, Indonesia, EU,Thailand\r\nWe will see the filter added as shown below. Register the changes by clicking Ok\r\n(5)Pivot the table.\r\nSelect all the columns and select Pivot\r\nAfter Pivot, table shows as below:\r\n(6)Formatting& Renaming\r\nThe first column format as Date\r\nRename First column as Dates,Second column as Import Value,Third column as Country\r\n(7)Filter Date\r\nAdd filter: click at right hand side corner\r\n\r\nSelect year>>next>\r\nSelect 2011-2020\r\n(8)Save the file as Import_T1.csv\r\n(9)Repeat above steps for T2 and Save the file as Export_T2.csv\r\n(10)In two csv files, to align the units for import and export values, times the existing value with 1mil for EU dollar, and times 1000 for the rest 9 countries.\r\n(11)Merge the two files.\r\nOpen T1 first , then click Add to add T2\r\nTo merge two tables : use inner join, join country and dates\r\nHide the repeated columns:Right click and select Hide\r\n(12)Create aliases for country data\r\n4.3 Creating charts.\r\nTo make a bubble chart for import and export value.x-axis as import and y-axis as export.\r\n(1)Drag and drop the variables:Import value and export value into column and rows. \r\n(2)Drag country into detail: \r\n(3)Analysis> Add calculation field:\r\nNet trade \r\nTotal trade\r\n(4)Color: Net trade\r\nEdit color as opacity 66% \r\n(5)Size: Total trade \r\n(6)Add filter: Year\r\nset as single value(list) \r\nShow Filter\r\n(7)Edit Title:\r\n \r\n(8)Add calculation for ranking:\r\nRank for Total trade: \r\nRank for Net trade: \r\n(9)Edit for tooltip:   \r\n(10)Create a second chart for tooltip:\r\nshowing annual trade value for net and total trade in 2010-2020.\r\nDrag year to columns, Net trade and total trade into Rows\r\n\r\nSelect Net trade as bar chart:\r\nSelect total trade as line chart:\r\nSet title as :Annual net trade and total trade value\r\nChange the two axis color.\r\nFinal chart looks like:\r\n\r\n(11)Add caption to describe all settings and data source\r\n\r\nFinal look for bubble chart\r\n\r\nWith tooltip added in\r\n\r\n4.4 Second chart\r\nTo monitor the quarterly changes for net trade value and total trade value, I added in a new chart, same as the chart in the tooltip, but add in the quarter in the columns.\r\n\r\n4.5 Create new dashboard\r\n\r\n5.0 Major Observations\r\n(1)United States of America(USA):\r\n* Total trade amount with the USA is about 19 Billion, increased from 2018 Q1 at 21 Billion to 2020 Q1 at 26 billion , and decreased to 24 billion at Q3 and Q4 2020.\r\n* The Covid-19 pandemic trend up on Q2 2020 which has impact on trading and economic.Second-quarter GDP plunged by worst-ever 32.9% * The USA was top 2 net importer from 2011 to 2019.However,From the 2020 Q2, it turns to be an exporter.From January to June 2020, exports of U.S. goods dropped by almost 25 percent, while imports of goods dropped by about 17 percent\r\n(2)Indonesia:\r\nIndonesia was the second largest Net exporter for Singapore in last ten years. However, the total trade value decreasing from 2010-2016 from 20 bil to 14 bil, then back to 17 bil in 2018, and has a dramatic drop in 2020 Q2 due to covid pandemic.Indonesia’s exports, imports nosedive in May as COVID-19 restrictions hit trade Time to dwell\r\n(3)Malaysia:\r\nIndonesia was the top 2 largest trade partner for Singapore in last ten years.From 2011 Q1 to 2016 Q2, Malaysia was the top 5 net exporter. And almost break even from 2016 Q3 to 2019 Q4. On the contrary,it become net importer in 2020.The largest net imports into Singapore were from Malaysia at 699,000 tonnes\r\n(4)Hong Kong:\r\nHong kong was the top exporter for Singapore in last ten years.Even during the covid pandemic period in 2020 Q2 , the trade value was about the same as in 2019 and reverted back from Q2 to Q4. Hong Kong mainly exported machines, precious metals and transportation facilities to Singapore\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-18T10:39:01+08:00",
    "input_file": "my-2nd-post.knit.md"
  }
]
